elisp/dot-emacs.org
** lisp
#+BEGIN_SRC emacs-lisp

;(use-package lispy
;  :init
;  (dolist (hook '(emacs-lisp-mode-hook
;                  lisp-interaction-mode-hook
;                  lisp-mode-hook
;                  scheme-mode-hook
;                  clojure-mode-hook))
;    (add-hook hook (lambda () (lispy-mode 1)))))
#+END_SRC
** markdown

#+BEGIN_SRC emacs-lisp
(use-package markdown-mode)
#+END_SRC

** babel
#+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages '((shell . t)
                             (emacs-lisp . t)
                             (http . t)
                             (org . t)))

(setq org-babel-default-header-args:sh
  '((:prologue . "exec 2>&1") (:epilogue . ":")))
#+END_SRC
* desktop
#+BEGIN_SRC emacs-lisp
(desktop-save-mode 1)
(setq desktop-restore-eager 10)
#+END_SRC
* templates/snippets
** yankpad
#+BEGIN_SRC emacs-lisp
(use-package yasnippet)
(use-package yankpad)

#+END_SRC
* multiple cursors

#+BEGIN_SRC emacs-lisp

(use-package multiple-cursors
  :config
  (progn
    ;; This is globally useful, so it goes under `C-x', and `m'
    ;; for "multiple-cursors" is easy to remember.
    (define-key ctl-x-map "\C-m" #'mc/mark-all-dwim)
    ;; Usually, both `C-x C-m' and `C-x RET' invoke the
    ;; `mule-keymap', but that's a waste of keys. Here we put it
    ;; _just_ under `C-x RET'.
    (define-key ctl-x-map (kbd "<return>") mule-keymap)

    ;; Remember `er/expand-region' is bound to M-2!
    (global-set-key (kbd "M-3") #'mc/mark-next-like-this)
    (global-set-key (kbd "M-4") #'mc/mark-previous-like-this)

    ;; These vary between keyboards. They're supposed to be
    ;; Shifted versions of the two above.
    (global-set-key (kbd "M-#") #'mc/unmark-next-like-this)
    (global-set-key (kbd "M-$") #'mc/unmark-previous-like-this)

    (define-prefix-command 'endless/mc-map)
    ;; C-x m is usually `compose-mail'. Bind it to something
    ;; else if you use this command.
    (define-key ctl-x-map "m" 'endless/mc-map)

    ;; Really really nice!
    (define-key endless/mc-map "i" #'mc/insert-numbers)
    (define-key endless/mc-map "h" #'mc-hide-unmatched-lines-mode)
    (define-key endless/mc-map "a" #'mc/mark-all-like-this)

    ;; Occasionally useful
    (define-key endless/mc-map "d"
      #'mc/mark-all-symbols-like-this-in-defun)
    (define-key endless/mc-map "r" #'mc/reverse-regions)
    (define-key endless/mc-map "s" #'mc/sort-regions)
    (define-key endless/mc-map "l" #'mc/edit-lines)
    (define-key endless/mc-map "\C-a"
      #'mc/edit-beginnings-of-lines)
    (define-key endless/mc-map "\C-e"
      #'mc/edit-ends-of-lines)))
#+END_SRC

* Custom 
#+BEGIN_SRC emacs-lisp

(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file)
  (load custom-file))

#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle custom.el

(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(js2-basic-offset 2)
 '(js2-bounce-indent-p nil)
 '(package-selected-packages
   (quote
    (helm-descbinds helm-git-grep helm-ls-git emmet-mode helm-org-rifle helm yaml-mode with-editor use-package smex php-mode markdown-mode js2-mode free-keys circe bbdb))))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(diff-context ((t (:inherit ##))))
 '(org-mode-line-clock ((t (:foreground "red" :box (:line-width -1 :style released-button)))))
 '(secondary-selection ((t (:background "gray96")))))


#+END_SRC


