elisp/custom.el
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(js2-basic-offset 2)
 '(js2-bounce-indent-p nil)
 '(package-selected-packages
   (quote
    (helm-descbinds helm-git-grep helm-ls-git emmet-mode helm-org-rifle helm yaml-mode with-editor use-package smex php-mode markdown-mode js2-mode free-keys circe bbdb))))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(diff-context ((t (:inherit ##))))
 '(org-mode-line-clock ((t (:foreground "red" :box (:line-width -1 :style released-button)))))
 '(secondary-selection ((t (:background "gray96")))))
